# Activity table:
# +-----------+-----------+------------+--------------+
# | player_id | device_id | event_date | games_played |
# +-----------+-----------+------------+--------------+
# | 1         | 2         | 2016-03-01 | 5            |
# | 1         | 2         | 2016-05-02 | 6            |
# | 1         | 3         | 2017-06-25 | 1            |
# | 3         | 1         | 2016-03-02 | 0            |
# | 3         | 4         | 2018-07-03 | 5            |
# +-----------+-----------+------------+--------------+
#
# Result table:
# +-----------+------------+---------------------+
# | player_id | event_date | games_played_so_far |
# +-----------+------------+---------------------+
# | 1         | 2016-03-01 | 5                   |
# | 1         | 2016-05-02 | 11                  |
# | 1         | 2017-06-25 | 12                  |
# | 3         | 2016-03-02 | 0                   |
# | 3         | 2018-07-03 | 5                   |
# +-----------+------------+---------------------+
# 对于 ID 为 1 的玩家，2016-05-02 共玩了 5+6=11 个游戏，2017-06-25 共玩了 5+6+1=12 个游戏。
# 对于 ID 为 3 的玩家，2018-07-03 共玩了 0+5=5 个游戏。
# 请注意，对于每个玩家，我们只关心玩家的登录日期。

SELECT a1.player_id, a1.event_date, sum(a2.games_played) as games_played_so_far
FROM Activity as a1
         cross join Activity as a2
                    on a1.player_id = a2.player_id and a1.event_date >= a2.event_date

group by a1.player_id, a1.event_date